webservices/exercises/lab04/ws-mc-poll.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:wsa="http://www.w3.org/2005/08/addressing"
               xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"
               xmlns:wsmc="http://docs.oasis-open.org/ws-rx/wsmc/200702"
               xsi:schemaLocation=
"http://schemas.xmlsoap.org/soap/envelope/
http://schemas.xmlsoap.org/soap/envelope/
http://www.w3.org/2005/08/addressing
http://www.w3.org/2006/03/addressing/ws-addr.xsd
http://docs.oasis-open.org/ws-rx/wsrm/200702
http://docs.oasis-open.org/ws-rx/wsrm/200702/wsrm-1.1-schema-200702.xsd
http://docs.oasis-open.org/ws-rx/wsmc/200702
http://docs.oasis-open.org/ws-rx/wsmc/200702/wsmc-1.1-schema-200702.xsd">
    <soap:Header>
        <wsa:Action>http://docs.oasis-open.org/ws-rx/wsmc/200702/MakeConnection</wsa:Action>
    </soap:Header>
    <soap:Body>
        <wsmc:MakeConnection>
            <wsmc:Address>http://docs.oasis-open.org/ws-rx/wsmc/200702/anonymous?id=1234</wsmc:Address>
        </wsmc:MakeConnection>
    </soap:Body>
</soap:Envelope>